int/resources/objectRepo/xmlTemplates/ows/OWSReservationAdvanced/req_UpdatePayRouting.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/og/4.3/ResvAdvanced/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:UpdatePayRoutingRequest>
         <res:ReservationRequest>
            <res:HotelReference chainCode="?" hotelCode="?"/>
            <res:KeyTrack Key1Track="?" Key2Track="?" Key3Track="?" Key4Track="?"/>
            <res:ReservationID>
               <com:UniqueID source="?" type="?"/>
            </res:ReservationID>
            <res:CheckOutTime/>
         </res:ReservationRequest>
         <res:PayRoutings Owner="?" Room="?" RoutingInstruction="?" Window="?">
            <res:RoutingType/>
            <res:RoutingInstructionsId/>
            <res:Resort/>
            <res:ResvNameID source="?" type="?"/>
            <res:RoutingCodes>
               <res:RoutingInstructionCode IsTransactionCode="?">
                  <res:InstructionCode/>
                  <res:TCGroup/>
                  <res:TCSubGroup/>
               </res:RoutingInstructionCode>
            </res:RoutingCodes>
            <res:BillToNameID source="?" type="?"/>
            <res:BeginDate/>
            <res:ToResvNameID source="?" type="?"/>
            <res:BillingInstructionCode/>
            <res:EndDate/>
            <res:AddTransaction/>
            <res:AddressID source="?" type="?"/>
            <res:AuthorizerID source="?" type="?"/>
            <res:RequestedBy/>
            <res:AccountCode/>
            <res:CreditLimit/>
            <res:LimitUsed/>
            <res:Comments/>
            <res:Declined/>
            <res:DeclinedBy/>
            <res:CompVoucherNo/>
            <res:CompCovers/>
            <res:CompTypeCode/>
            <res:RoutingPercent/>
            <res:RoutingLimitType/>
            <res:MembershipID source="?" type="?"/>
            <res:Day1/>
            <res:Day2/>
            <res:Day3/>
            <res:Day4/>
            <res:Day5/>
            <res:Day6/>
            <res:Day7/>
            <res:DayString/>
            <res:Daily/>
         </res:PayRoutings>
         <res:CreditCardID source="?" type="?"/>
         <res:PaymentType/>
      </res:UpdatePayRoutingRequest>
   </soapenv:Body>
</soapenv:Envelope>